odd = [1, 3, 5, 7, 9]
print(odd)

print(odd[0])

# 리스트 인덱싱
a = [1, 2, 3]
print( a )

# 리스트의 슬라이싱
a = [1, 2, 3, 4, 5]
b = a[0:2]
print( a[0:2] )

a = "12345"
b = a[0:2]
print( a[0:2] )

a = [1, 2, 3, 4, 5]
b = a[:2]
c = a[2:]
print( a[:2] )
print( a[2:] )

a = [1, 2, 3, 4, 5]
b = a[1:3]
print( a[1:3])

# 리스트 더하기(+)

a = [1, 2, 3]
b = [4, 5, 6]
print( a + b )

# 리스트 반복하기(*)

a = [1, 2, 3]
print( a * 3 )

# 리스트 길이 구하기

a = [1, 2, 3]
b = len(a)
print( len(a) )

# 리스트에서 값 수정하기

a = [1,2,3]
a[2] = 4

